In [1]:
import numpy as np
import pandas as pd

In [2]:
nums = pd.Series(range(500))
nums.head(10)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [3]:
nums.tail(10)

490    490
491    491
492    492
493    493
494    494
495    495
496    496
497    497
498    498
499    499
dtype: int64

In [4]:
nums1 = pd.Series([1, 2, np.nan, 4, 5])
nums1

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [5]:
hello = pd.Series(list("hello"))
hello

0    h
1    e
2    l
3    l
4    o
dtype: object

In [6]:
nums1.count()

4

In [7]:
len(nums1)

5

In [8]:
nums1.sum()

12.0

In [9]:
nums1.sum(skipna=False)

nan

In [10]:
nums1.mean()

3.0

In [11]:
nums1.median()

3.0

In [12]:
nums1.std()

1.8257418583505538

In [13]:
nums1.max()

5.0

In [14]:
nums1.min()

1.0

In [15]:
somechar = pd.Series(list("AaBbCc"))
somechar

0    A
1    a
2    B
3    b
4    C
5    c
dtype: object

In [16]:
somechar.max()

'c'

In [17]:
somechar.min()

'A'

In [18]:
nums1.describe()

count    4.000000
mean     3.000000
std      1.825742
min      1.000000
25%      1.750000
50%      3.000000
75%      4.250000
max      5.000000
dtype: float64

In [19]:
hello.describe()

count     5
unique    4
top       l
freq      2
dtype: object

In [20]:
list(nums1)

[1.0, 2.0, nan, 4.0, 5.0]

In [21]:
dict(nums1)

{0: 1.0, 1: 2.0, 2: nan, 3: 4.0, 4: 5.0}

In [22]:
superheros = [
    "Batman",
    "Superman",
    "Spider-Man",
    "Iron Man",
    "Captain America",
    "Wonder Woman"
]
strength_levels = (100, 120, 90, 95, 110, 120)

pd.Series(strength_levels, superheros)

Batman             100
Superman           120
Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [23]:
heros = pd.Series(index = superheros, data = strength_levels)
heros

Batman             100
Superman           120
Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [24]:
heros[-4:]

Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [25]:
heros.tail(4)

Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [26]:
heros.nunique()

5

In [27]:
print(heros.mean())
print(heros.median())
print(heros.max())
print(heros.min())

105.83333333333333
105.0
120
90

In [28]:
dict(heros)

{'Batman': 100,
 'Superman': 120,
 'Spider-Man': 90,
 'Iron Man': 95,
 'Captain America': 110,
 'Wonder Woman': 120}

In [29]:
pokemons = pd.read_csv("datas/pokemon.csv", index_col="Pokemon").squeeze()
pokemons

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [30]:
pokemons.describe()

count        809
unique       159
top       Normal
freq          65
Name: Type, dtype: object

In [31]:
pokemons.count()

809

In [32]:
pokemons.nunique()

159

In [33]:
pokemons.sort_values()

Pokemon
Illumise                Bug
Silcoon                 Bug
Pinsir                  Bug
Burmy                   Bug
Wurmple                 Bug
                  ...
Tirtouga       Water / Rock
Relicanth      Water / Rock
Corsola        Water / Rock
Carracosta     Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

In [34]:
pokemons.sort_values(ascending = False)

Pokemon
Empoleon      Water / Steel
Corsola        Water / Rock
Relicanth      Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
                  ...
Kricketune              Bug
Cascoon                 Bug
Scatterbug              Bug
Kricketot               Bug
Grubbin                 Bug
Name: Type, Length: 809, dtype: object

In [35]:
google = pd.read_csv("datas/google_stocks.csv",
                     parse_dates=["Date"],
                     index_col="Date").squeeze("columns")
google

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [36]:
war = pd.read_csv("datas/revolutionary_war.csv",
                  parse_dates=["Start Date"],
                  index_col="Start Date",
                  usecols=["Start Date", "State"]).squeeze("columns")
war

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [37]:
print(sum(war.isnull()))
print(sum(war.notnull()))
print(war.nunique())

70
162
17

In [38]:
war.isnull().sum()

70

In [39]:
len(war) - war.count()

70

In [40]:
war.count()

162

In [41]:
war.sort_values(na_position="first")

Start Date
1775-09-17         NaN
1775-12-31         NaN
1776-03-03         NaN
1776-03-25         NaN
1776-05-18         NaN
                ...
1781-07-06    Virginia
1781-07-01    Virginia
1781-06-26    Virginia
1781-04-25    Virginia
1783-01-22    Virginia
Name: State, Length: 232, dtype: object

In [42]:
war.sort_values(na_position="last")

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [43]:
war.dropna()

Start Date
1774-09-01     Massachusetts
1774-12-14     New Hampshire
1775-04-19     Massachusetts
1775-04-19     Massachusetts
1775-04-20          Virginia
                   ...
1782-08-15          Virginia
1782-08-19          Virginia
1782-08-26    South Carolina
1782-09-11          Virginia
1783-01-22          Virginia
Name: State, Length: 162, dtype: object

In [44]:
pokemons.sort_index(ascending=True)

Pokemon
Abomasnow        Grass / Ice
Abra                 Psychic
Absol                   Dark
Accelgor                 Bug
Aegislash      Steel / Ghost
                  ...
Zoroark                 Dark
Zorua                   Dark
Zubat        Poison / Flying
Zweilous       Dark / Dragon
Zygarde      Dragon / Ground
Name: Type, Length: 809, dtype: object

In [45]:
war.sort_index()

# NaT = Not a Time

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [46]:
war.loc[war.index.dropna()]

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-19    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 250, dtype: object

In [47]:
war.loc[war.index.notnull()]

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 228, dtype: object

In [48]:
google.sort_values(ascending=False).head(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [49]:
google.sort_values(ascending=True).head(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [50]:
google.sort_values(ascending=False)[:10]

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [51]:
google.nlargest(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [52]:
google.nsmallest(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [53]:
pokemons.value_counts()

Normal                65
Water                 61
Grass                 38
Psychic               35
Fire                  30
                      ..
Fire / Psychic         1
Normal / Ground        1
Psychic / Fighting     1
Dark / Ghost           1
Fire / Ghost           1
Name: Type, Length: 159, dtype: int64

In [54]:
bins = np.linspace(0, 1400, 8)
bins

array([   0.,  200.,  400.,  600.,  800., 1000., 1200., 1400.])

In [56]:
google.describe()

count    3824.000000
mean      479.945860
std       328.528592
min        49.820000
25%       235.860000
50%       314.680000
75%       708.205000
max      1287.580000
Name: Close, dtype: float64

In [57]:
google.value_counts(bins=bins)

(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [66]:
google.value_counts(bins=bins).sort_index(ascending = True)

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [67]:
google.value_counts(bins=8, sort=False)

(48.581, 204.54]       651
(204.54, 359.26]      1435
(359.26, 513.98]       263
(513.98, 668.7]        466
(668.7, 823.42]        334
(823.42, 978.14]       161
(978.14, 1132.86]      283
(1132.86, 1287.58]     231
Name: Close, dtype: int64

In [70]:
d = {'c1': [1, 2, "누락"], 'c2': [1.11,'', 3.33], 'c3': ["one", "two", "three"]}
df_csv = pd.DataFrame(data=d)
df_csv

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [73]:
df_csv.to_csv("datas/sample1.csv", index=False)

In [74]:
%pwd

'C:\\python'

In [75]:
%cd C:\\python\\datas

C:\python\datas

In [77]:
df_read = pd.read_csv("sample1.csv")
df_read

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [77]:
df_read = pd.read_csv("sample1.csv")
df_read

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [78]:
%pwd

'C:\\python\\datas'

In [79]:
df_csv.to_csv("sample2.csv", index=False, header=False)

In [84]:
pd.read_csv('sample2.csv', names=['c1', 'c2', 'c3'])

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [88]:
%%writefile sample3.txt
c1       c2       c3       c4
0.179181 -1.538472 1.347553 0.43381
1.024209 0.087307 -1.281997 0.49265
0.417899 -2.002308 0.255245 -1.10515

Writing sample3.txt

In [89]:
pd.read_table('sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [91]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample4.txt

In [92]:
pd.read_csv('sample4.txt', skiprows=[0, 1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [95]:
df_na_val = pd.read_csv('sample1.csv', na_values=['누락'])
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [97]:
df_na_val.to_csv('sample5.txt', sep='|')

In [99]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [101]:
titanic.describe()

         survived         age  n_siblings_spouses       parch        fare
count  627.000000  627.000000          627.000000  627.000000  627.000000
mean     0.387560   29.631308            0.545455    0.379585   34.385399
std      0.487582   12.511818            1.151090    0.792999   54.597730
min      0.000000    0.750000            0.000000    0.000000    0.000000
25%      0.000000   23.000000            0.000000    0.000000    7.895800
50%      0.000000   28.000000            0.000000    0.000000   15.045800
75%      1.000000   35.000000            1.000000    0.000000   31.387500
max      1.000000   80.000000            8.000000    5.000000  512.329200

In [128]:
subair = pd.read_csv('서울교통공사_지하역사 공기질 측정 정보_20211231.csv', encoding="cp949")
subair

,연번,호선,역명,미세먼지,초미세먼지,이산화탄소,포름알데히드,일산화탄소,이산화질소,휘발성유기화합물,라돈
0,1,1,시청,54.600,27.900000,490.0,5.1,0.6,0.030,26.1,35.366667
1,2,1,종각,103.575,66.050000,590.0,6.3,1.1,0.052,104.3,33.650000
2,3,1,종로3가,58.800,39.200000,491.0,6.6,0.9,0.042,32.5,25.400000
3,4,1,종로5가,88.100,48.333333,667.0,7.9,1.1,0.038,291.3,30.433333
4,5,1,동대문,69.000,42.350000,528.0,7.5,1.1,0.044,95.5,40.550000
...,...,...,...,...,...,...,...,...,...,...,...
250,251,8,남한산성입구,36.400,26.600000,521.5,11.7,1.2,0.020,116.7,40.400000
251,252,8,단대오거리,31.400,20.100000,444.0,6.9,1.0,0.019,117.4,20.900000
252,253,8,신흥,39.200,19.900000,458.0,14.8,1.1,0.019,63.5,27.200000
253,254,8,수진,36.800,22.300000,459.5,19.7,1.0,0.019,186.6,23.600000
254,255,8,모란,39.800,29.800000,473.0,10.6,0.9,0.019,89.2,27.200000

In [127]:
%cd C:\python\datas

C:\python\datas

In [126]:
%cd

C:\Users\user

In [129]:
import requests

In [130]:
response = requests.get('https://apis.data.go.kr/B551172/CancerRegistryMetaService/getColorectalCancerRegistryMetaInfo1?numOfRows=1000&pageNo=10&resultType=JSON&serviceKey=mVnox%2F0TH6h7tKAZCqbx4CSGUirWCiLeUvcdWzz4X9dQzhPBE8pgKKak6n3entF1n2h3t8%2F5BctvfDHdZ7b27w%3D%3D')

In [131]:
response.status_code

200